
import random 
import time

# Настройки игры
duration = 5 # Время записи
sample_rate = 44100
max_err = 3
score = 0
err = 0

# Слова для превода
words_by_level = {
    "easy": ["кот", "собака", "яблоко", "молоко", "солнце"],
    "medium": ["банан", "школа", "друг", "окно", "жёлтый"],
    "hard": ["шестой", " вустершир", "информация", "озорной.", "воображение"]
}
# Начало игры
print("Привет, добро пожаловать в игру ")
time.sleep(1)
a = input("Напишите уровень сложности. easy, medium, или hard?")


if a == 'easy': 
    print("Уровень сложности задан")
    time.sleep(1)
    print("Преведите слова которые видите снизу")
    print(random.choice("кот", "собака", "яблоко", "молоко", "солнце"))

if a == 'medium':
    print("Уровень сложности задан")
    time.sleep(1)
    print("Переведите слова которые видите снизу")
    print(random.choice("банан", "школа", "друг", "окно", "жёлтый"))

if a == 'сложный':
    print("Уровень сложности задан")
    time.sleep(1)
    print("Преведите слова которые видите снизу")
    print(random.choice("технология", "университет", "информация", "произношение", "воображение"))
